#include <stdio.h>

// --------------------------------------------------------------------------------------------------------------------------------------------- //
//자가진단1
//자연수 n을 입력받고 1부터 홀수를 차례대로 더해 나가면서 합이 n 이상이면 그 때까지 더해진 홀수의 개수와 그 합을 출력하는 프로그램을 작성하시오
// int main() {
//     int n = 0, sum = 0, cnt = 0;
//     int i;

//     scanf("%d", &n);

//     for(i = 1; ; i++) {
//         if(sum >= n) break;
//         if(i % 2 == 1) {
//             sum += i;
//             cnt++;
//         }
//     }

//     printf("%d %d", cnt, sum);
    
//     return 0;
// }

// --------------------------------------------------------------------------------------------------------------------------------------------- //
//자가진단2
//자연수 n을 입력받아서 n줄만큼 다음과 같이 출력하는 프로그램을 작성하시오
// int main() {
//     int n = 0;

//     scanf("%d", &n);

//     for(int i = 1; i <= n; i++) {
//         for(int j = 1; j <= i; j++) {
//             printf("*");
//         }
//         printf("\n");
//     }

//     return 0;
// }

// --------------------------------------------------------------------------------------------------------------------------------------------- //
//자가진단3
//자연수 n을 입력받아서 다음과 같이 출력하는 프로그램을 작성하시오
// int main() {
//     int n = 0;

//     int i, j;

//     scanf("%d", &n);

//     for(i = n; i >= 1; i--) { // n -> 1까지 n = 3 -> 3 2 1
//         for(j = 1; j <= i; j++) {
//             printf("*");
//         }
//         printf("\n");
//      }

//      for(i = 1; i <= n; i++) {
//         for(j = 1; j <= i; j++) {
//             printf("*");
//         }
//         printf("\n");
//      }

//     return 0;
// }

// --------------------------------------------------------------------------------------------------------------------------------------------- //
//자가진단4
//자연수 n을 입력받아서 다음과 같이 출력하는 프로그램을 작성하시오
// int main() {
//     int n = 0;
//     int i, j;

//     scanf("%d", &n);

//     for(i = n; i > 0; i--) {
//         for(j = n; j >= i; j--) {
//             printf(" ");
//         }
//         for(j = 1; j <= i; j++) {
//             printf("*");
//         }
//         printf("\n");
//     }
//     return 0;
// }

// --------------------------------------------------------------------------------------------------------------------------------------------- //
//자가진단5
//자연수 n을 입력받아서 다음과 같이 출력하는 프로그램을 작성하시오
// int main() {
//     int n = 0;
//     int i, j;

//     scanf("%d", &n);

//     for(i = n; i >= 1; i--) {
//         for(j = n; j >= i; j--) {
//             printf(" ");
//         }
//         for(j = 1; j <= i * 2 - 1; j++) {  // <----- 조건식!!
//             printf("*");
//         }
//         printf("\n");
//     }
//     return 0;
// }

// --------------------------------------------------------------------------------------------------------------------------------------------- //
//자가진단6
//자연수 n을 입력받아 다음과 같이 영문자를 출력하는 프로그램을 작성하시오
// int main() {
//     int n = 0;
//     int i, j;
//     char ch = 'A';

//     scanf("%d", &n);

//     for(i = n; i >= 1; i--) {
//         for(j = 1; j <= i; j++) {
//             printf("%c", ch); 
//             ch++; //'A' (65) -> ++을 해주게 되면 A 고유 아스키 코드값이 증가하여 ['B' (66) → 'C' (67) → 'D' (68) → 'E' (69)] 이렇게 진행 된다
//         }
//         printf("\n");
//     }

//     return 0;
// }

// --------------------------------------------------------------------------------------------------------------------------------------------- //
//자가진단7
//자연수 n을 입력받아서 n개의 줄에 n + 1개의 숫자와 문자로 채워서 다음과 같이 출력하는 프로그램을 작성하시오.
int main() {
    int n = 0, cnt = 1;
    int i, j;
    char ch = 'A';

    scanf("%d", &n);

    for(i = 1; i <= n; i++) {
        for(j = 1; j <= n - i + 1; j++) {
            printf("%d ", cnt++);
        }
        for(j = 1; j <= i; j++) {
            printf("%c ", ch++);
        }
        printf("\n");
    }

    return 0;
}

// --------------------------------------------------------------------------------------------------------------------------------------------- //
