#include <stdio.h>

// --------------------------------------------------------------------------------------------------------------------------------------------- //
//자가진단1
//문자를 입력받아서 입력받은 문자를 20번 반복하여 출력하는 프로그램을 작성하시오.

// int main() {
//     char data;
//     int i;

//     scanf("%c", &data);

//     for (i = 1; i <= 20; i++) {
//         printf("%c", data);
//     }
    
//     return 0;
// }

// --------------------------------------------------------------------------------------------------------------------------------------------- //
//자가진단2
//10부터 20까지의 숫자를 차례대로 출력하는 프로그램을 작성하시오.

// int main() {
//     int i;

//     for (i = 10; i <= 20; i++)
//     {
//         printf("%d ", i);
//     }
    
//     return 0;
// }

// --------------------------------------------------------------------------------------------------------------------------------------------- //
//자가진단3
//한 개의 수를 입력받아 1부터 입력받은 수까지의 짝수를 차례대로 출력하는 프로그램을 작성하시오. (입력 받는 수는 2 이상 50 이하의 정수이다.)

// int main() { 
//     int num = 0;
//     int i;

//     scanf("%d", &num);

//     for(i = 1; i <= num; i++) {
//         if(i % 2 == 0) {
//             printf("%d ", i);
//         }
//     }

//     return 0;
// }

// --------------------------------------------------------------------------------------------------------------------------------------------- //
//자가진단4
//정수를 입력받아서 입력받은 정수부터 100까지의 합을 출력하는 프로그램을 작성하시오. (입력 받는 정수는 100 이하의 자연수)
// int main() {
//     int num = 0, sum = 0;
//     int i;

//     scanf("%d", &num);

//     for(i = num; i <= 100; i++) { 
//         sum += i;
//     }

//     printf("%d", sum);

//     return 0;
// }

// --------------------------------------------------------------------------------------------------------------------------------------------- //
//자가진단5
//10개의 정수를 입력받아 3의 배수의 개수와 5의 배수의 개수를 각각 출력하는 프로그램을 작성하시오
// int main() {
//     int num = 0;
//     int three_cnt = 0, five_cnt = 0;
//     int i;

//     for(i = 1; i <= 10; i++) {
//         scanf("%d", &num);

//         if(num % 3 == 0) {
//             three_cnt++;
//         }
//         if(num % 5 == 0) {
//             five_cnt++;
//         }
//     }

//     printf("Multiples of 3 : %d\n", three_cnt);
//     printf("Multiples of 5 : %d", five_cnt);

//     return 0;
// }

// --------------------------------------------------------------------------------------------------------------------------------------------- //
//자가진단6
//10 이하의 과목수 n을 입력받은 후 n개 과목의 점수를 입력받아서 평균을 구하여 출력하고 평균이 80점 이상이면 "pass", 아니면 "fail"이라고 출력하는 프로그램을 작성하시오.
//평균은 반올림하여 소수 첫째자리까지 출력한다
// int main() {
//     int n = 0;
//     int num = 0, sum = 0;
//     double avg = 0.0;

//     scanf("%d", &n);

//     for(int i = 1; i <= n; i++) {
//         scanf("%d", &num);
//         sum += num;
//     }

//     avg = (double)sum / n;

//     if(avg >= 80) {
//         printf("avg : %.1lf\n", avg);
//         printf("pass");

//     } else {
//         printf("avg : %.1lf\n", avg);
//         printf("fail");
//     }

//     return 0;
// }

// --------------------------------------------------------------------------------------------------------------------------------------------- //
//자가진단7
//아래와 같이 출력되는 프로그램을 작성하시오
// int main() {
//     int i, j;
//     int num = 2;

//     for(i = 6; i <= 10; i++) {
//         for(j = num; j <= i; j++) {
//             printf("%d ", j);
//         }
//         printf("\n");
//         num++;
//     }

//     return 0;
// }

// --------------------------------------------------------------------------------------------------------------------------------------------- //
//자가진단8
//구구단의 일부를 다음과 같이 출력하는 프로그램을 작성하시오.
// int main() {
//     int i, j;

//     for(i = 2; i <= 4; i++) {
//         for(j = 1; j <= 5; j++) {
//             printf("%d * %d =  %d   ", i, j, i * j);
//         }
//         printf("\n");
//     }

//     return 0;
// }

// --------------------------------------------------------------------------------------------------------------------------------------------- //
